In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# SÓLO PARA MÍ
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
!ls /content/drive/MyDrive

#### Ejercicio
* Carga en un dataframe Pandas llamado `df` el fichero 'Random_Sales_Data.xlsx'.
* Convierte el campo 'Order Date' en formato `fecha`. 
----------------
* Load into a Pandas dataframe called `df` the file 'Random_Sales_Data.xlsx'.
* Convert the 'Order Date' field to the `date` format.

In [ ]:
# Cargando los datos en un dataframe
# Loading the data into a dataframe

# Respuesta

  Sales Representative       Location  ...  Price Total Sale Amount
0          Sara Snyder  Massachusetts  ...  12.42             74.52
1          Sara Snyder       New York  ...  12.42             86.94
2       Diane Gonzalez     Washington  ...  16.32             32.64
3          Sara Snyder     New Jersey  ...  12.42             12.42
4          Sara Snyder     New Jersey  ...  17.83             53.49

[5 rows x 9 columns]

In [ ]:
# Mostrar los valores distintos/únicos en una columna de un dataframe de Pandas
# Show distinct values of a Pandas dataframe column
df.Region.unique()

array(['East', 'West'], dtype=object)

In [ ]:
df.Location.unique()

array(['Massachusetts', 'New York', 'Washington', 'New Jersey', 'Oregon',
       'California', 'Connecticut', 'Nevada'], dtype=object)

#### La tabla pivotante más sencilla posible ha de estar vinculada a un dataframe y tener al menos un índice.
#### The simplest pivot table must have a dataframe and an index .

In [ ]:
df.pivot_table(df,index=["Region"])

            Price  Quantity  Total Sale Amount
Region
East    22.676618  5.533352         126.214083
West    23.258073  5.500000         127.350479

#### Una tabla pivotante puede tener múltiples índices. Estos índices de se pasan como argumentos mediante una lista. 
#### A pivot_table can have multiple indexes as well. The pivot_table can take multiple values (args) via a list.

In [ ]:
df.pivot_table(index=['Region', 'Sales Representative','Order Date'])

                                            Price  Quantity  Total Sale Amount
Region Sales Representative Order Date
East   Frances Warren       2016-01-02  12.420000  7.000000          86.940000
                            2016-01-03  17.830000  8.000000         142.640000
                            2016-01-04  15.125000  8.000000         123.705000
                            2016-01-05  29.166667  5.666667         109.856667
                            2016-01-06  35.590000  6.000000         213.540000
...                                           ...       ...                ...
West   Patrick Graham       2016-12-27  23.627500  2.750000          68.752500
                            2016-12-28  28.994615  4.230769         124.725385
                            2016-12-29  21.688000  6.600000         150.094000
                            2016-12-30  23.816250  4.000000         128.075000
                            2016-12-31  26.930000  6.000000         148.370000

[1640 rows x 3 columns]

#### Ejercicio
 
* Muestra mediante una tabla pivotante muestra las ventas de cada representante de ventas
* Use a pivot table to show the the sales of each sales representative

In [ ]:
# Respuesta

                          Price  Quantity  Total Sale Amount
Sales Representative
Diane Gonzalez        24.127637  5.586066         133.632760
Frances Warren        23.045939  5.574240         130.216136
Patrick Graham        22.787969  5.453471         123.954151
Randy Watson          22.583480  5.691441         127.382185
Sara Snyder           22.619089  5.457462         124.691804

#### Ejercicio
 
* Muestra mediante una tabla pivotante muestra las ventas por region, localización y por representante de ventas
* Use a pivot table to show the the sales grouped by regiom, location and sales representative

In [ ]:
# Respuesta

                                               Price  ...  Total Sale Amount
Region Location      Sales Representative             ...
East   Connecticut   Frances Warren        24.866000  ...         159.488364
                     Randy Watson          22.162262  ...         130.860833
                     Sara Snyder           21.024490  ...         113.668776
       Massachusetts Frances Warren        22.439326  ...         129.287416
                     Randy Watson          20.660065  ...         118.627994
                     Sara Snyder           22.697083  ...         124.907125
       New Jersey    Frances Warren        22.331120  ...         124.032160
                     Randy Watson          23.128686  ...         120.554114
                     Sara Snyder           23.887419  ...         134.311041
       New York      Frances Warren        23.529652  ...         126.874527
                     Randy Watson          24.253188  ...         138.656406
                     Sara Snyder           22.194910  ...         121.553579
West   California    Diane Gonzalez        25.185446  ...         146.201362
                     Patrick Graham        25.277232  ...         135.599859
       Nevada        Diane Gonzalez        23.381455  ...         119.083818
                     Patrick Graham        22.428391  ...         117.135862
       Oregon        Diane Gonzalez        24.377754  ...         123.175187
                     Patrick Graham        22.020584  ...         123.653660
       Washington    Diane Gonzalez        23.293538  ...         133.916679
                     Patrick Graham        21.742052  ...         117.580821

[20 rows x 3 columns]

#### Mostrar sólo las columnas que son de nuestro interés
#### Show only the columns that are of interest to us.

Podemos ocultar las columnas que no nos interesan definiendo expresamente las que sí son de nuestro interés mediante el parámetro `values`

For this purpose, we can remove them by explicitly defining the columns we care about using the parameter `values`.

In [ ]:
df.pivot_table(index=['Sales Representative'], values='Total Sale Amount')

                      Total Sale Amount
Sales Representative
Diane Gonzalez               133.632760
Frances Warren               130.216136
Patrick Graham               123.954151
Randy Watson                 127.382185
Sara Snyder                  124.691804

#### El parámetro `values` anterior nos devuelve la media aritmética de los valores por defecto
#### The previous `values` parameter returns the arithmetic mean of the default values

In [ ]:
# Comprobación / Validation
df[df['Sales Representative'] == 'Diane Gonzalez']['Total Sale Amount'].mean()

133.63275956284136

In [ ]:
# Comprobación / Validation

sales_representative_list = df['Sales Representative'].unique()
for i in (np.sort(sales_representative_list)):
  print(i, ': ',df[df['Sales Representative'] == i]['Total Sale Amount'].mean())

Diane Gonzalez :  133.63275956284136
Frances Warren :  130.21613595706606
Patrick Graham :  123.95415066469718
Randy Watson :  127.38218468468466
Sara Snyder :  124.69180381218062

In [ ]:
print(np.sort(sales_representative_list))

['Diane Gonzalez' 'Frances Warren' 'Patrick Graham' 'Randy Watson'
 'Sara Snyder']

In [ ]:
df.loc[:,['Sales Representative','Total Sale Amount']].sort_values(by='Sales Representative').mean()

Total Sale Amount    126.631135
dtype: float64

Por defecto, Pandas calcula la media de los calores de la columna. Podemos contarlos o sumarlos usando `aggfunc` and `np.sum`.
Pandas automatically averages the data but we can do a count or a sum. Using `aggfunc` and `np.sum`.

In [ ]:
pd.pivot_table(df,index=['Sales Representative'],values=['Total Sale Amount'],aggfunc=np.sum)

                      Total Sale Amount
Sales Representative
Diane Gonzalez                 97819.18
Frances Warren                 72790.82
Patrick Graham                167833.92
Randy Watson                  113115.38
Sara Snyder                   268212.07

In [ ]:
# Comprobación / Validation
df.groupby(['Sales Representative'])['Total Sale Amount'].sum().reset_index()

  Sales Representative  Total Sale Amount
0       Diane Gonzalez           97819.18
1       Frances Warren           72790.82
2       Patrick Graham          167833.92
3         Randy Watson          113115.38
4          Sara Snyder          268212.07

#### Ejercicio
Repite el ejercicio anterior pero esta vez calculando el número de ventas (contar) de cada Sales Representative.
 
Repeat the previous exercise but this time calculating the number of sales (count) for each Sales Representative.

In [ ]:
# Respuesta

                      Total Sale Amount
Sales Representative
Diane Gonzalez                    732.0
Frances Warren                    559.0
Patrick Graham                   1354.0
Randy Watson                      888.0
Sara Snyder                      2151.0

#### Podemos aplicar varias funciones a diferentes columnas mediante un diccionario clave: valor (columna:función).
#### We can apply several functions to different columns using a key: value dictionary (column: function).
* aggfunc can take a list of functions. Example mean using the numpy mean function and len to get a count.
 aggfunc=[np.mean,len])

In [ ]:
# Ejemplo
pd.pivot_table(df,index=['Sales Representative'],values=['Total Sale Amount'],aggfunc=[np.mean,len])

                                  mean               len
                     Total Sale Amount Total Sale Amount
Sales Representative
Diane Gonzalez              133.632760             732.0
Frances Warren              130.216136             559.0
Patrick Graham              123.954151            1354.0
Randy Watson                127.382185             888.0
Sara Snyder                 124.691804            2151.0

#### Si queremos analizar las ventas en función de los diferentes productos, el parámetro `columns` nos permite mostrar una o más columnas
#### If we want to see Item column broken down by the items, the `columns` variable allows us to define one or more columns.

In [ ]:
# Columnas --> Item 	Junk 	Stuff 	Things 	Widgets
# Agrupación por ( Region 	Sales Representative 	Order Date), desde dentro hacia afuera. Por defecto suma los elementos
# Datos mostrados --> Columna Items
df.pivot_table(index=['Region', 'Sales Representative','Order Date'], columns=['Item'], values='Total Sale Amount')

Item                                     Junk   Stuff   Things  Widgets
Region Sales Representative Order Date
East   Frances Warren       2016-01-02  86.94     NaN      NaN      NaN
                            2016-01-03    NaN     NaN  142.640      NaN
                            2016-01-04  86.94     NaN  160.470      NaN
                            2016-01-05    NaN   97.92  178.300   53.350
                            2016-01-06    NaN     NaN  106.980  320.100
...                                       ...     ...      ...      ...
West   Patrick Graham       2016-12-27  24.84   65.28      NaN  160.050
                            2016-12-28  53.82     NaN   62.405  234.740
                            2016-12-29  66.24     NaN  178.300  373.450
                            2016-12-30  43.47   32.64   17.830  400.125
                            2016-12-31  80.73  106.08      NaN  266.750

[1640 rows x 4 columns]

EJERCICIO
  
* Empleando el dataframe anterior muestra 'Price' y 'Total Sale Amount'
* Aplica la función contar a Price y suma a Total Sale Amount
* Elimina los NaN si todos los elementos de alguna fila o columna son NaN. (dropna=True elimina los NaN si todos los elementos de una fila o columna son NaN.)
* Ejemplo: pd.pivot_table(df, index=['Manager', 'Status'], columns=['Product'], values=['Quantity','Price'],aggfunc={'Quantity':len,'Price':[np.sum, np.mean]},fill_value=0)
--------------------
* Using the previous dataframe show 'Price' and 'Total Sale Amount'
* Apply the count function to Price and add (sum) to Total Sale Amount
* Eliminate the NaN if all the elements of any row or column are NaN. (dropna = True removes NaNs if all elements in a row or column are NaN.)
* Example: pd.pivot_table (df, index = ['Manager', 'Status'], columns = ['Product'], values = ['Quantity', 'Price'], aggfunc = {'Quantity': len, 'Price': [np.sum, np.mean]}, fill_value = 0)

In [ ]:
# Respuesta

                                       Price        ... Total Sale Amount
Item                                    Junk Stuff  ...            Things  Widgets
Region Sales Representative Order Date              ...
East   Frances Warren       2016-01-02   1.0   NaN  ...               NaN      NaN
                            2016-01-03   NaN   NaN  ...            142.64      NaN
                            2016-01-04   1.0   NaN  ...            160.47      NaN
                            2016-01-05   NaN   1.0  ...            178.30    53.35
                            2016-01-06   NaN   NaN  ...            106.98   320.10
...                                      ...   ...  ...               ...      ...
West   Patrick Graham       2016-12-27   2.0   1.0  ...               NaN   160.05
                            2016-12-28   6.0   NaN  ...            124.81  1173.70
                            2016-12-29   3.0   NaN  ...            178.30   373.45
                            2016-12-30   4.0   1.0  ...             17.83   800.25
                            2016-12-31   4.0   2.0  ...               NaN   800.25

[1640 rows x 8 columns]

NOTA / NOTE
Columns vs. Values
* Una de las cosas que pueden confundir al usar pivot_tables es el uso de los parámetros columns y values. El parámetro 'columns' es opcional, proporporcionan una forma adicional de segmentar los valores de interés. Las funciones de agregación, son aplicadas, exclusivamente, a los valores listados.
* One of the confusing points with the pivot_table is the use of columns and values . Remember, columns are optional - they provide an additional way to segment the actual values you care about. The aggregation functions are applied to the values you list.

* Los elementos NaN, (valores que no existen) se pueden eliminar con el parámetro fill_value=0
* The NaN’s values can be removed using the fill_value parameter and setting them to 0.

pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],
               columns=["Product"],aggfunc=[np.sum],fill_value=0)

* Añadir totales. margins=True calcula los totales por nosotros
* Add totals, margins=True does compute the totals that for us.

In [ ]:
pd.pivot_table(df,index=['Region', 'Location', 'Sales Representative'],
               values=['Quantity', 'Total Sale Amount'],
               aggfunc=[np.sum],fill_value=0,margins=True)

                                               sum
                                          Quantity Total Sale Amount
Region Location      Sales Representative
East   Connecticut   Frances Warren            333           8771.86
                     Randy Watson              480          10992.31
                     Sara Snyder              1031          22279.08
       Massachusetts Frances Warren           1032          23013.16
                     Randy Watson             1775          36656.05
                     Sara Snyder              3934          89933.13
       New Jersey    Frances Warren            703          15504.02
                     Randy Watson              999          21096.97
                     Sara Snyder              2561          61917.39
       New York      Frances Warren           1048          25501.78
                     Randy Watson             1800          44370.05
                     Sara Snyder              4213          94082.47
West   California    Diane Gonzalez           1228          31140.89
                     Patrick Graham           1918          48002.35
       Nevada        Diane Gonzalez            309           6549.61
                     Patrick Graham            461          10190.82
       Oregon        Diane Gonzalez            967          23033.76
                     Patrick Graham           2101          46617.43
       Washington    Diane Gonzalez           1585          37094.92
                     Patrick Graham           2904          63023.32
All                                          31382         719771.37

#### Ejercicio
* Partiendo del ejercicio anterior, calcula también total por productos vendidos
* Starting from the previous exercise, calculate the total for products sold as well.

In [ ]:
# Respuesta

                                               sum        ...
                                          Quantity        ... Total Sale Amount
Item                                          Junk Stuff  ...           Widgets        All
Region Location      Sales Representative                 ...
East   Connecticut   Frances Warren            142    37  ...           5495.05    8771.86
                     Randy Watson              237    56  ...           5708.45   10992.31
                     Sara Snyder               440   195  ...           9869.75   22279.08
       Massachusetts Frances Warren            422   138  ...          10670.00   23013.16
                     Randy Watson              803   299  ...          14724.60   36656.05
                     Sara Snyder              1636   651  ...          44493.90   89933.13
       New Jersey    Frances Warren            290   123  ...           7095.55   15504.02
                     Randy Watson              441   173  ...           8909.45   21096.97
                     Sara Snyder              1032   428  ...          33770.55   61917.39
       New York      Frances Warren            400   122  ...          13764.30   25501.78
                     Randy Watson              631   336  ...          24327.60   44370.05
                     Sara Snyder              1844   664  ...          44974.05   94082.47
West   California    Diane Gonzalez            464   189  ...          18085.65   31140.89
                     Patrick Graham            748   269  ...          27421.90   48002.35
       Nevada        Diane Gonzalez            100    82  ...           2560.80    6549.61
                     Patrick Graham            226    49  ...           4908.20   10190.82
       Oregon        Diane Gonzalez            398   125  ...          12217.15   23033.76
                     Patrick Graham            919   335  ...          21980.20   46617.43
       Washington    Diane Gonzalez            680   205  ...          19259.35   37094.92
                     Patrick Graham           1265   441  ...          28168.80   63023.32
All                                          13118  4917  ...         358405.30  719771.37

[21 rows x 10 columns]